'use strict';
const information = [
  {
    img: './image/خالد_بن_الوليد.png',
    name: 'خالد بن الوليد بن المغيرة المخزومي القرشي',
    birthData: 'ولد 30ق.م (592م) في مكة',
    deathData: 'توفي 20اغسطس سنة 21هجريا(642م)',
    nickname: 'سيف الله المسلول',
    content:
      'خالد بن الوليد بن المغيرة (592-642م) هو أحد الصحابة البارزين للنبي محمد صلى الله عليه وسلم وأحد القادة العسكريين البارعين في الإسلام. وُلد خالد بن الوليد في مكة المكرمة قبل الإسلام، وكان يعرف بلقب "سيف الله المسلول" أي "سيف الله المسلول" نظرًا لشجاعته في الميدان العسكري. كان خالد بن الوليد أحد المعانقين للإسلام في مكة بعد فتح مكة، وكان له دور بارز في الدعوة الإسلامية. قبل إسلامه، كان من أعداء المسلمين وشارك في معارك ضد الإسلام، ولكن بعد إسلامه، أصبح أحد أبرز القادة العسكريين في جيش المسلمين. خالد بن الوليد شارك في العديد من المعارك الهامة خلال الفترة النبوية وبعد وفاة النبي محمد صلى الله عليه وسلم، مثل معركة مؤتة ومعركة مئة الف ومعركة اليرموك. كان له دور كبير في فتح الشام وفارس والعراق. رغم أنه كان قويًا وشجاعًا في الميدان العسكري، فإنه أيضًا كان عادلًا وحكيمًا كحاكم، وكان يتمتع بشخصية قوية وذكاء استراتيجي. وفي النهاية، توفي خالد بن الوليد في عهد الخلافة الراشدة لعثمان بن عفان، ورغم تألقه في الميدان العسكري، إلا أنه اعتزل الحياة العسكرية في نهاية ',
  },
  {
    img: './image/القعقاع_بن_عمرو_التميمي.jpg',
    name: 'القعقاع بن عمرو بن مالك التميمي',
    birthData: 'ولد في الجزيرة العربية (نجد)',
    deathData: 'المنزلة (الدقهلية) وفيها يوجد مقامه',
    nickname: 'لا يوجد',
    content:
      'القعقاع بن عمرو التميمي هو شخصية تاريخية عاشت في العصر الإسلامي الأول، وكان من الصحابة الذين التقوا بالنبي محمد صلى الله عليه وسلم وأسلموا في مراحل مبكرة من الدعوة الإسلامية. يعتبر القعقاع بن عمرو من الأسماء التي لها مكانة في التاريخ الإسلامي، ولكن قد تكون المعلومات المتاحة عن حياته محدودة. تمتاز شخصية القعقاع بن عمرو بالشجاعة والإيمان، وكان من الصحابة الذين شاركوا في العديد من المعارك الهامة خلال فترة حياة النبي محمد وبعد وفاته. قد شارك في معركة بدر ومعركة أحد، وكان له دور بارز في دعم الإسلام في تلك الفترة الحرجة. لا تتوفر معلومات مفصلة كثيرة عن حياة القعقاع بن عمرو، وذلك قد يكون ناتجًا عن قلة التسجيلات التاريخية حول حياة بعض الصحابة. ومع ذلك، يظل له مكانة كبيرة في التاريخ الإسلامي كأحد الركائز الذين دعموا الدعوة الإسلامية في بداياتها.',
  },
  {
    img: './image/تخطيط_اسم_زيد_بن_حارثة.png',
    name: '	زيد بن حارثة الكلبي',
    birthData: 'ولد 43 ق.هـ في شبه الجزيرة العربية',
    deathData: 'توفي في سنة 629 (47–48 سنة)',
    nickname: 'حِبّ رسول الله',
    content:
      ' زيد بن حارثة هو شخصية تاريخية هامة في الإسلام وكان من أبرز الصحابة (التابعين) الذين عاشوا في فترة النبي محمد صلى الله عليه وسلم. وُلد زيد في مكة المكرمة وكان ينتمي إلى قبيلة قريش.أحد الأحداث المهمة في حياة زيد بن حارثة كانت قصة تبنيه من قبل النبي محمد صلى الله عليه وسلم. كان زيد ابنًا لحارثة بن شريح وزهرة بن كلاب، وبعد أن تمت تبنيه من قبل النبي صلى الله عليه وسلم، أصبح يعرف باسم "زيد بن محمد". ولكن فيما بعد، نزلت آية قرآنية (سورة الأحزاب، الآية 4) تلغي مفهوم التبني وأعطت زيد اسمه الأصلي، زيد بن حارثه.شارك زيد بن حارثة في العديد من المعارك الهامة، مثل معركة مؤتة ومعركة الخندق. كان له دور بارز في خدمة الإسلام والمسلمين.زيد بن حارثة قتل في معركة مؤتة عام 8 هـ (629 م) أثناء قتاله مع المسلمين ضد قوات بني فهرة. يُحترم زيد بن حارثة كشخصية رائدة في تاريخ الإسلام ومن الصحابة الذين قدموا خدمات كبيرة للدين وللمجتمع المسلم.',
  },
  {
    img: './image/طلحة_بن_عبيد_الله.png',
    name: 'طلحة بن عبيد اللُّه التيمي القرشي',
    birthData:
      'ولد 28 قبل الهجرة تقريبًا، 594 م مكة، تهامة، شبه الجزيرة العربية',
    deathData: 'توفي في 36 هـ، 656 م البصرة',
    nickname: 'أبو مُحمَّد',
    content:
      'طلحة بن عبيد الله التمي القرشي هو أحد الصحابة البارزين في تاريخ الإسلام وكان من أقرب الأصدقاء والأقارب للنبي محمد صلى الله عليه وسلم. وُلد طلحة في مكة المكرمة قبل بعثة النبي محمد صلى الله عليه وسلم بفترة. تألق طلحة بن عبيد الله في ميدان العطاء والجهاد، وكان من الصحابة البارزين الذين شاركوا في معظم المعارك الهامة خلال حياة النبي محمد وبعدها. شارك في بدايات الدعوة الإسلامية وكان وفياً للنبي. من أبرز مشاركاته في المعارك تشمل معركة بدر ومعركة أحد ومعركة الخندق وغيرها. كان طلحة بن عبيد الله من العشرة المبشرين بالجنة، وهو واحد من الصحابة الذين شهدوا البيعة تحت شجرة الرضاع. بعد وفاة النبي محمد صلى الله عليه وسلم، استمر طلحة في خدمة الإسلام وشارك في فتوحات الإسلام الهامة. وكان له دور بارز في عهد الخلفاء الراشدين، خاصة في عهد الخليفة الثالث عثمان بن عفان. توفي طلحة بن عبيد الله في عهد الخلافة الأموية، حيث وقعت مأساة الجمل في العام 36 هـ، وقد قتل في هذا الصراع. يُحترم طلحة بن عبيد الله باعتباره أحد القادة العسكريين والصحابة المحبوبين في التاريخ الإسلامي.',
  },
  {
    img: './image/تخطيط_اسم_الزبير_بن_العوام.png',
    name: 'الزبير بن العوام',
    birthData: 'ولد 28 ق.هـ 594 م',
    deathData: 'توفي في 36 هـ، 656 م',
    nickname: 'حواري رسول الله',
    content:
      'الزُّبَيْرُ بن العَوَّامِ التميمي القرشي هو صحابي بارز في تاريخ الإسلام، وكان أحد أقرب الناس إلى النبي محمد صلى الله عليه وسلم. وُلد الزبير في مكة المكرمة، وهو ابن العوام بن خويلد بن عبد مناف القرشي. من أبرز الصفات التي تميز بها الزبير هو شجاعته وإخلاصه للإسلام وللنبي صلى الله عليه وسلم. شارك في معظم المعارك الهامة خلال حياة النبي وكان حاضرًا في غزواته ومعاركه، بما في ذلك معركة بدر ومعركة أحد. تمتزج حياة الزبير بن العوام مع تاريخ الإسلام، وكان من الصحابة البارزين الذين أسهموا في بناء الدولة الإسلامية. بعد وفاة النبي محمد صلى الله عليه وسلم، كان للزبير دور بارز في خلافة الخلفاء الراشدين. شارك في معركة الجمل ومعركة صفين. وفي النهاية، تم قتل الزبير بن العوام في معركة الجمل عام 36 هـ. كان للزبير أيضًا مكانة عظيمة في قلوب المسلمين، ويُحترم كواحد من أعظم الصحابة والقادة في التاريخ الإسلامي.',
  },
  {
    img: './image/Abdurrahman_ibn_Awf_Masjid_an-Nabawi_Calligraphy.png',
    name: 'عبدالرحمن بن عوف',
    birthData: 'ولد 43 ق.هـ 581م',
    deathData: 'توفي في 32 هـ 653م',
    nickname: 'الغني الشاكر',
    content:
      'عبد الرحمن بن عوف هو أحد الصحابة البارزين في تاريخ الإسلام، وكان من أوائل الذين أسلموا وأقرب الناس إلى النبي محمد صلى الله عليه وسلم. ولد عبد الرحمن بن عوف في مكة المكرمة، وكان من عائلة قريشية نبيلة. عبد الرحمن بن عوف كان أحد العشرة المبشرين بالجنة، حيث شهدوا بيعة الرضوان تحت شجرة الحديبية. قبل إسلامه، كان عبد الرحمن معتنقًا للديانة الوثنية في مكة، ولكن بعد الدعوة الإسلامية، أسلم وتحولت حياته بشكل جذري. شارك عبد الرحمن بن عوف في الهجرة إلى المدينة المنورة وكان من المهاجرين الأولين. لعب دورًا هامًا في معظم المعارك الرئيسية التي خاضها المسلمون، مثل معركة بدر ومعركة أحد. كما شارك في بيعة العقبة الثانية. بعد وفاة النبي محمد صلى الله عليه وسلم، شارك عبد الرحمن بن عوف في اختيار الخليفة الأول أبو بكر الصديق، وكان له دور هام في فترة خلافة عمر بن الخطاب. وقد توفي عبد الرحمن بن عوف في عهد الخلافة الثانية لعلي بن أبي طالب. يُحترم عبد الرحمن بن عوف بشكل كبير في التاريخ الإسلامي، ويُعد من الصحابة الذين قدموا خدمات عظيمة للإسلام والمسلمين.',
  },
  {
    img: './image/أبو_بكر_الصديق.gif',
    name: 'عبدالله بن أبي قحافة(ابوبكر الصديق)',
    birthData: 'ولد 50 ق.هـ / 573م',
    deathData: 'توفي في الإثنين 22 جمادى الآخرة 13هـ - 22 أغسطس 634م',
    nickname: 'ابو بكر الصديق',
    content:
      'أبو بَكْرِ الصِّدِّيقِ (573 - 23 أغسطس 634) هو صحابي بارز وأحد أقرب الناس إلى النبي محمد صلى الله عليه وسلم، وكان أحد أول الذين أسلموا في الإسلام. اسمه الحقيقي عبد الله بن أبي قحافة. وُلِدَ أبو بكر في مكة المكرمة. أبو بكر الصديق لعب دورًا بارزًا في مراحل عديدة من تاريخ الإسلام. كان من العشرة المبشرين بالجنة، حيث شهدوا بيعة الرضوان تحت شجرة الحديبية. شارك في هجرة النبي محمد إلى المدينة المنورة وكان من المهاجرين الأوائل. عند وفاة النبي محمد صلى الله عليه وسلم، تولى أبو بكر الخلافة الراشدة بناءً على البيعة من قبل المسلمين، وكانت فترة خلافته تشهد العديد من التحديات والانتصارات. قاد الجيش المسلم في معركة مؤتة ومعركة تبوك. وفي عام 632 ميلادي، توفي أبو بكر الصديق رضي الله عنه، ودُفن في المدينة المنورة. يُعد أبو بكر الصديق من أفضل الخلفاء الراشدين، وكانت فترة حكمه معلمة في تاريخ الإسلام، حيث نما الإسلام وتوسعت أراضي المسلمين تحت قيادته.',
  },
  {
    img: './image/250px-علي_بن_أبي_طالب.gif',
    name: 'علي بن ابي طالب',
    birthData: 'ولد 13 رجب 23 ق هـ، الموافق 17 مارس 599م',
    deathData: 'توفي في 21 رمضان 40 هـ، الموافق 27 يناير 661م',
    nickname: 'أبو الحسن، أبو تراب',
    content:
      'علي بن أبي طالب (عليه السلام) هو صحابي بارز في تاريخ الإسلام، وهو أحد العشرة المبشرين بالجنة وأحد أفضل الصحابة وأقرب الناس إلى النبي محمد صلى الله عليه وسلم. وُلِدَ علي في مكة المكرمة حوالي عام 600 ميلادي. علي بن أبي طالب هو ابن عم النبي محمد صلى الله عليه وسلم، وكان أحد الأشخاص الذين أسلموا في سن صغيرة. تميز علي بالشجاعة والفطنة، وشارك في جميع المعارك الرئيسية التي خاضها المسلمون، بدءًا من معركة بدر وصولاً إلى معركة صفين. تزوج علي بن أبي طالب من فاطمة بنت محمد، ابنة النبي محمد صلى الله عليه وسلم، وكان لهما أبناء، بينهم الحسن والحسين (عليهما السلام). بعد وفاة الخليفة الثالث عثمان بن عفان، تولى علي بن أبي طالب الخلافة وأصبح الخليفة الرابع للمسلمين. وفي عهده، واجه الإسلام تحديات عديدة، بما في ذلك الفتنة الكبرى والصراعات الداخلية. توفي علي بن أبي طالب في مدينة الكوفة في العراق في سنة 661 ميلادي، بعد أن أصيب بجرح قاتل أثناء صلاة الفجر. يُعتبر علي بن أبي طالب شخصية رائدة في التاريخ الإسلامي، وتُحترم شخصيته في الشيعة والسنة على حد سواء.',
  },
  {
    img: './image/Uthman_Dhul-nurayn_Masjid_an-Nabawi_Calligraphy.svg.png',
    name: 'عثمان بن عفان',
    birthData: 'ولد سنة 47 ق.هـ، الموافق 576م',
    deathData: 'توفي في 12 ذي الحجة 35 هـ، الموافق 656م',
    nickname: 'أبو عبدِ اللّٰه، أَبُو عَمْرُو',
    content:
      'عثمان بن عفان هو صحابي بارز وأحد الخلفاء الراشدين في تاريخ الإسلام. وُلِدَ عثمان في مكة المكرمة حوالي عام 576 ميلادي. كان يعتبر من أغنى أهل مكة وكان معروفًا بلقب "ذو النورين"، وذلك بسبب زواجه من ابنتي النبي محمد صلى الله عليه وسلم، رقية وأم كلثوم. تميز عثمان بن عفان بالتسامح والكرم، وكان من الذين أسلموا في مرحلة مبكرة من الدعوة الإسلامية. شارك في هجرة المسلمين إلى المدينة المنورة وكان من المهاجرين الأوائل. شارك أيضًا في جميع المعارك الرئيسية التي خاضها المسلمون، بما في ذلك معركة بدر ومعركة أحد. بعد وفاة الخليفة الثاني عمر بن الخطاب، تولى عثمان بن عفان الخلافة الراشدة في عام 644 ميلادي. وفي عهده، شهدت الدولة الإسلامية توسعًا وازدهارًا، وتم ترتيب القرآن الكريم بصورته الحالية. ومع ذلك، وقعت الفتنة الكبرى في عهد عثمان، وانتهت باغتياله في منزله في مدينة المدينة المنورة في عام 656 ميلادي. تاريخ استشهاد عثمان بن عفان يعتبر حدثًا هامًا في تاريخ الإسلام وأثر بشكل كبير في الأحداث اللاحقة.',
  },
  {
    img: './image/Umar2.png',
    name: 'عمر بن الخطاب',
    birthData: 'ولد مابين عاميّ 586 و590م تقريبًا، سنة 40 ق.هـ',
    deathData: 'توفي في 	7 نوفمبر 644م، الموافق 26 ذو الحجة 23 هـ',
    nickname: '	أبو حفص',
    content:
      'عمر بن الخطاب (عمر بن الخطّاب) هو أحد الصحابة البارزين وأحد الخلفاء الراشدين في تاريخ الإسلام. وُلِدَ عمر بن الخطاب في مكة المكرمة حوالي سنة 584 ميلادي، وكان جدّه عبد الله بن قرش. عمر بن الخطاب كان يعتبر واحدًا من أعداء الإسلام في بدايات الدعوة، ولكن بعد أن أسلم في السنة السادسة من البعثة النبوية، أصبح من أبرز الصحابة والدعاة إلى الإسلام. كانت إسلامه حادثة هامة في تاريخ الدعوة الإسلامية. تميز عمر بن الخطاب بشخصيته القوية وحكمته. شارك في معظم المعارك الرئيسية مثل معركة بدر ومعركة أحد ومعركة الخندق. بعد وفاة الخليفة الأول أبو بكر الصديق، تولى عمر بن الخطاب الخلافة في سنة 634 ميلادي. في عهده الخلافة، شهدت الدولة الإسلامية توسعًا هائلًا، حيث واصل فتوحات الإسلام في فارس والشام ومصر. أيضًا، نظّم أنظمة الحكم والقضاء وأدخل إصلاحات اقتصادية واجتماعية. توفي عمر بن الخطاب بسبب الاغتيال في عام 644 ميلادي، ودُفن في المدينة المنورة. يُحترم عمر بن الخطاب كشخصية عظيمة في التاريخ الإسلامي، ويُعتبر من القادة الراشدين الذين أثروا في بناء وتنظيم الدولة الإسلامية.',
  },
];
// Variable to hold HTML element
const personbtn = document.querySelectorAll('.container div');
const closebtn = document.querySelector('.icon');
const switchLeftbtn = document.querySelector('.left');
const switchRightbtn = document.querySelector('.right');
const layout = document.querySelector('.layout');
const contentPage = document.querySelector('.content');
const namePart = document.querySelector('.name');
const birthPart = document.querySelector('.birth');
const deathPart = document.querySelector('.death');
const nicknamePart = document.querySelector('.nickname');
const infoPart = document.querySelector('.content > p');
const imgPart = document.querySelector('.head img');
// variable to hold id number
let currentId;
// function to close content page
const closeModel = function () {
  layout.classList.add('hidden');
  contentPage.classList.add('hidden');
  switchLeftbtn.classList.add('hidden');
  switchRightbtn.classList.add('hidden');
};
// function to open content page
const openModel = function (currentId) {
  layout.classList.remove('hidden');
  contentPage.classList.remove('hidden');
  imgPart.src = information[currentId].img;
  namePart.textContent = information[currentId].name;
  birthPart.textContent = information[currentId].birthData;
  deathPart.textContent = information[currentId].deathData;
  nicknamePart.textContent = information[currentId].nickname;
  infoPart.textContent = information[currentId].content;
  if (currentId === 0) {
    switchRightbtn.classList.remove('hidden');
    switchLeftbtn.classList.add('hidden');
  } else if (currentId === 9) {
    switchLeftbtn.classList.remove('hidden');
    switchRightbtn.classList.add('hidden');
  } else {
    switchRightbtn.classList.remove('hidden');
    switchLeftbtn.classList.remove('hidden');
  }
};
// open content page
for (let i = 0; i < personbtn.length; i++)
  personbtn[i].addEventListener('click', function (e) {
    currentId = Number(e.target.id);
    openModel(currentId);
  });
// Keyboard event
document.addEventListener('keydown', function (e) {
  if (e.key === 'Escape') {
    closeModel();
  } else if (e.key === 'ArrowRight') {
    currentId++;
    openModel(currentId);
  } else if (e.key === 'ArrowLeft') {
    currentId--;
    openModel(currentId);
  }
});
// layout click
layout.addEventListener('click', closeModel);
// close content page
closebtn.addEventListener('click', closeModel);
// switch left
switchLeftbtn.addEventListener('click', function () {
  currentId--;
  openModel(currentId);
});
// switch right
switchRightbtn.addEventListener('click', function () {
  currentId++;
  openModel(currentId);
});
